[
  {
    "title": "PP-Checker: プログラミング教育における大規模言語モデルと協調した曖昧性のある自動採点システム",
    "image": "img-15",
    "description": "本論文では，プログラミング教育における採点業務の効率化を目指し，即時性，採点精度，曖昧性に焦点を当てた自動採点システムPP-Checkerを提案する．PP-Checkerは，大規模言語モデル（LLM）との協調により，動的かつ視覚的なプログラミング言語の自動採点を実現する．また，リアルタイムでプロンプトを調整できる機能を備えており，学生が課題に取り組んでいる間にも採点基準を更新し，結果をすぐに反映できる．実際の講義で計2400分運用した結果から，PP-Checkerは課題の再提出時間を平均3.6分まで短縮し，課題採点業務の効率化に貢献することが示された．",
    "authors": "関口祐豊, 中村聡史",
    "conference": "WISS2024 in 苗場",
    "date": "2024/12/12",
    "url": "https://dl.nkmr-lab.org/papers/540",
    "tagList": ["WISS", "M2", "LLM", "大規模言語モデル", "GPT", "Processing", "プログラミング教育", "クリエイティブコーディング"],
    "paper": "https://dl.nkmr-lab.org/papers/540/paper.pdf",
    "slide": "https://dl.nkmr-lab.org/papers/540"
  },
  {
    "title": "ComiQA: A Comic Question-Answer Sharing System that Helps Users to Recollect the Content of Previous Volumes",
    "image": "img-13",
    "description": "It takes several months or years to release a new volume of a comic book after the previous volume. Therefore, when reading a long-awaited newest volume of a comic, it is sometimes difficult to recollect and understand the flow of the story, causing the readers to reread the previous volume or reread from the first volume to check the story. Re-reading can be fun when there is enough time. However, when there are many volumes of the comic or the time is limited, the reader will want to recollect the previous content as soon as possible to read the newest volume. One way to recollect the previous content quickly is to check its summary. However, a synopsis is often not enough to recollect everything and may become a spoiler if the reader has forgotten to read the previous volume. In this paper, we proposed and implemented a system that enables users to recollect the content of the previous volume by quizzes (question-answer pairs). We considered that just reading a question text would not be a spoiler. In addition, we released our system, “ComiQA,” as a Web service and found the characteristics of quizzes made by analyzing the registered 1465 quizzes in our service. We also experimented to investigate and compare the degree of recollection of creating quizzes and writing reviews. We found that creating quizzes helps people recollect the episodes more effectively than writing reviews, and viewing the quiz leads to further recollection.",
    "authors": "Yume Tanaka, Yuto Sekiguchi, Tsubasa Sakurai, Satoshi Nakamura",
    "conference": "KES2024 in Spain",
    "date": "2024/09/11",
    "url": "https://dl.nkmr-lab.org/papers/537",
    "tagList": ["KES", "M2", "漫画", "クイズ", "https://comiqa.com"],
    "paper": "https://dl.nkmr-lab.org/papers/537/paper.pdf",
    "slide": "https://dl.nkmr-lab.org/papers/537",
    "system": "https://comiqa.com"
  },
  {
    "title": "Manga Scene Estimation by Quiz and Answer",
    "image": "img-14",
    "description": "In reading manga, it is common to look back at the storyline when following a serialized work. Although there are services that assist comic re-reading through quizzes, searching for specific parts related to the quiz takes a lot of time and complicates the review process. Therefore, in this study, we examined whether it is possible to estimate the scenes related to the quiz based on the quiz questions, answers, and manga-specific features. To achieve this, we extracted key elements from the comic and proposed two estimation methods: a word-based CS method and a context-based GPT method. Furthermore, we discussed extractable and difficult-to-estimate scenes in comics. The results showed that the pages containing the answers could be estimated with a probability of 66.7%. Pages containing specific keywords or events were easier to estimate, while those requiring an understanding of the comic’s overall time series and context were more difficult to estimate. In addition, since the accuracy varied greatly depending on the presence or absence of the answer text, it can be considered that the content as close as possible to the topic of the quiz can be estimated if important keywords such as the answer text are included.",
    "authors": "Tsubasa Sakurai, Yume Tanaka, Yuto Sekiguchi, Satoshi Nakamura",
    "conference": "KES2024 in Spain",
    "date": "2024/09/11",
    "url": "https://dl.nkmr-lab.org/papers/538",
    "tagList": ["KES", "M2", "漫画", "クイズ", "https://comiqa.com"],
    "paper": "https://dl.nkmr-lab.org/papers/538/paper.pdf",
    "slide": "https://dl.nkmr-lab.org/papers/538",
    "system": "https://comiqa.com"
  },
  {
    "title": "コミクエ: 他者が作成したクイズが漫画の既読巻の想起に及ぼす影響",
    "image": "img-13",
    "description": "漫画の最新巻を読むときに話の流れがわからず，前巻や前々巻を読み直すことがある．時間が十分にあるときには読み直すことは楽しいものであるが，購入し続けている漫画のタイトル数が多い場合や時間に限りがある場合には出来るだけ手早く前の巻の状況を思い出したいと考えることも多い．前巻の内容を手軽に振り返る方法の一つにあらすじがあるが，前巻を読んでいなかった場合，そのあらすじがネタバレとなる可能性がある．我々はこれまでの研究において，最新巻を読む際の想起を支援するため，クイズ形式で振り返りを可能とするシステムを実装してきた．また，読者自身がクイズを作成し，一週間後にそのクイズを振り返ることでどの程度想起できるのか調査を行い，感想を記述するよりもクイズを作成する方が想起を促すことが明らかとなった．しかし，他者が作成したクイズが想起に有効であるか明らかにできていなかった．また，漫画の新刊が発売されるまでおよそ数か月かかることを考慮することができておらず，実用性を検証できていなかった．そこで本研究では，漫画を読んだ約 5 か月後に想起度合いを調査することで，他者が作成したクイズが想起に有効であるか検証を試みた．その結果，他者が作成したクイズを確認することも想起に繋がることが明らかとなった．",
    "authors": "田中佑芽, 関口祐豊, 櫻井翼, 中村聡史",
    "conference": "EC-71 in 京都",
    "date": "2024/03/19",
    "url": "https://dl.nkmr-lab.org/papers/509",
    "tagList": ["EC", "M1", "漫画", "クイズ", "https://comiqa.com"],
    "paper": "https://dl.nkmr-lab.org/papers/509/paper.pdf",
    "slide": "https://dl.nkmr-lab.org/papers/509",
    "system": "https://comiqa.com"
  },
  {
    "title": "漫画の振り返りを支援するクイズとその答えからのシーン推定",
    "image": "img-12",
    "description": "漫画の読書において，連載作品を読んでいると物語やキャラクタについて忘れてしまいがちである．ここで，クイズ形式で漫画の振り返りを支援するサービスがあるが，そのクイズに該当する部分を改めて探すことは手間であり，振り返りを難しくしていたことがあげられる．そのため本研究では，漫画に対するクイズ内容とその答え，またその漫画的特徴を利用し，そのクイズに該当するシーンを推定可能かについて検証を行なった．また，漫画内で抽出可能な箇所や推定が難しい場面についての考察を行ったところ，特定のキーワードや出来事があった場面は推定しやすく，一方でクイズに登場頻度の高いキャラクタ名が含まれる場合や，後からその出来事について説明がなされる場面の推定が困難であった．",
    "authors": "櫻井翼, 田中佑芽, 関口祐豊, 中村聡史",
    "conference": "HCG2023 in 福岡",
    "date": "2023/12/12",
    "url": "https://dl.nkmr-lab.org/papers/487",
    "tagList": ["HCG", "M1", "漫画", "クイズ", "https://comiqa.com"],
    "paper": "https://dl.nkmr-lab.org/papers/487/paper.pdf",
    "slide": "https://dl.nkmr-lab.org/papers/487"
  },
  {
    "title": "PP-Undo+: 筆圧を軸とした手書き編集手法",
    "image": "img-11",
    "description": "これまで我々は，複雑に交差するストロークの一部を，筆圧の強弱を活用することで Undo 可能とする手法を提案し，PP-Undo として実装してきた．しかし，ユーザにとって筆圧を完璧に制御することは容易ではなかった．そこで本研究では，デジタル端末上での手書き編集をよりよいものにするため，筆圧ベースの削除機能，ストローク群のグループ化，という筆圧に着目した編集機能を提案した．また，筆圧の設定を容易にするための可視化を行った．本システムにより，ユーザが筆圧を利用しつつ，1 つのノートにおいて，レイヤ分けしたかのような編集が可能となる",
    "authors": "関口祐豊, 中村聡史",
    "conference": "第31回WISS in 八ヶ岳",
    "date": "2023/11/29",
    "url": "https://dl.nkmr-lab.org/papers/482",
    "tagList": ["WISS", "M1", "手書き", "筆圧", "Undo"],
    "paper": "https://dl.nkmr-lab.org/papers/482/paper.pdf",
    "slide": "https://dl.nkmr-lab.org/papers/482",
    "code": "https://github.com/YutoSekiguchi/PP-Undo-Plus",
    "system": "https://ppundo.nkmr.io"
  },
  {
    "title": "PP-Undo: 筆圧を軸としたUndo機能のためのストローク群に対する一括筆圧情報付与手法の提案とその評価",
    "image": "img-6",
    "description": "手書きにおいて，確信度や重要度ベースでストロークをまとめて削除することは既存の Undo や消しゴムでは手間である．我々はこれまでの研究において，筆圧を利用することで確信度ベースで Undo を可能とする PP-Undo を提案してきた．しかし，これまでの PP-Undo はストロークごとの筆圧を Undo の軸としているため，文字単位での削除や文章や図形などの意味的なまとまりごとでの削除ができないという問題があった．そこで本稿では，長期的な利用により得られた 36,465 本のストロークを分析し，筆圧値のブレが大きくなってしまう状況が生じてしまうことが明らかになった．また，グループの最初のストロークでグループの筆圧を設定する手法および，筆圧設定を失敗した場合に筆圧を再設定する手法を提案し，その精度を調査した．その結果，平均および上位 25% を利用した筆圧設定の精度が高く，最初に筆圧を調整することはユーザにとって容易であることが明らかとなった．",
    "authors": "関口祐豊, 中村聡史",
    "conference": "HCI-204 in 北海道",
    "date": "2023/08/09",
    "url": "https://dl.nkmr-lab.org/papers/468",
    "tagList": ["HCI", "M1", "手書き", "筆圧", "Undo"],
    "paper": "https://dl.nkmr-lab.org/papers/468/paper.pdf",
    "slide": "https://dl.nkmr-lab.org/papers/468",
    "code": "https://github.com/YutoSekiguchi/PP-Undo",
    "system": "https://ppundo.nkmr.io"
  },
  {
    "title": "コミクエ: 漫画の内容のクイズ作成が既読巻の想起に与える影響",
    "image": "img-10",
    "description": "漫画の最新巻を読むときに話の流れが分からず，前巻や前々巻を読み直すことがある．前巻の内容を振り返る方法の一つにあらすじがあるが，前巻を読んでいなかった場合，そのあらすじがネタバレとなる可能性がある．我々はこれまでの研究において，最新巻を読む際の想起を支援するため，クイズ形式で振り返りを可能とするシステムを実装し，クイズの種類の分析を行ってきた．しかし，実際に読者の想起度合いの調査は行なっておらず，クイズによる手法が想起に効果的かどうかを明らかにできていなかった．そこで本研究では，クイズの作成およびその確認が読者への想起を促すという仮説を立て，読書後にクイズを作成する手法と感想を書く手法とで，1 週間後の想起度合いを調査することで，仮説の検証を試みた．実験の結果，クイズを作成することが想起のための記憶に繋がり，またクイズの閲覧がさらなる想起につながることを明らかにした．",
    "authors": "田中佑芽, 関口祐豊, 櫻井翼, 小松原達哉, 中村聡史",
    "conference": "HCI204 in 北海道",
    "date": "2023/08/08",
    "url": "https://dl.nkmr-lab.org/papers/463",
    "tagList": ["HCI", "M1", "漫画", "クイズ", "https://comiqa.com"],
    "paper": "https://dl.nkmr-lab.org/papers/463/paper.pdf",
    "slide": "https://dl.nkmr-lab.org/papers/463",
    "system": "https://comiqa.com"
  },
  {
    "title": "Do People Tend to Select a Delayed Item?",
    "image": "img-9",
    "description": "Dark patterns that lead users to unintentionally harmful behaviors are often used in e-commerce and social media, and consumer troubles are frequent. Dark patterns are also seen in choice situations, where some attempt to induce the user's behavior by making specific options prominent. Focusing on user interfaces that seem fair at first glance, but induce users to make a choice, we investigated the effect of delayed display of options for inducing users to make a choice. Specifically, we conducted a crowdsourcing experiment based on the hypothesis that when only one choice is delayed, the delayed choice is more likely to be selected. The experimental results showed no tendency for the delayed option to be chosen more often overall. However, we found that the effect of the delayed display of alternatives on choice varied from person to person. Specifically, it was suggested that a delayed display of the option in the upper left corner of the screen with a delay time of 0.1 seconds for early choosers and a delayed display of the choice in the center of the screen with a delay time of 0.2 seconds for late choosers might induce their choice behavior.",
    "authors": "Yuichiro Kinoshita, Yuto Sekiguchi, Riho Ueki, Kouta Yokoyama, Satoshi Nakamura",
    "conference": "HCII in Denmark",
    "date": "2023/07/28",
    "url": "https://dl.nkmr-lab.org/papers/450",
    "tagList": ["HCII", "M1", "選択", "ダークパターン"],
    "paper": "https://dl.nkmr-lab.org/papers/450/paper.pdf",
    "slide": "https://dl.nkmr-lab.org/papers/450"
  },
  {
    "title": "Does the Average Color Influence Selection?",
    "image": "img-8",
    "description": "The Goldilocks effect is the tendency to select the middle choice when three choices that can be expressed in three levels, such as size and price, are presented. We investigate the possibility that the Goldilocks effect can also be applied to color and that it unintentionally distorts the choice. Specifically, we hypothesized that when presented with three choices consisting of two different colors and their average color (the average of the two colors), people would choose the average color, and we conducted a crowdsourcing experiment. The experiment results showed that people did not tend to choose the average color option. However, analysis by gender showed that females tended to select the average color option while males did not. In addition, when the average colors were similar to one of the two colors in the three options, both males and females tended to select the less similar different color option.",
    "authors": "Yuto Sekiguchi, Riho Ueki, Kouta Yokoyama, Satoshi Nakamura",
    "conference": "HCII in Denmark",
    "date": "2023/07/28",
    "url": "https://dl.nkmr-lab.org/papers/452",
    "tagList": ["HCII", "M1", "選択", "色", "ゴルディロックス効果"],
    "paper": "https://dl.nkmr-lab.org/papers/452/paper.pdf",
    "slide": "https://dl.nkmr-lab.org/papers/452"
  },
  {
    "title": "選択肢の時間差表示が選択行動に及ぼす影響",
    "image": "img-7",
    "description": "ユーザを騙して意図していないことを実行させるダークパターンが問題になっている．我々は，選択インタフェースとして一見公平でありながらも，実際には選択を誘導しているダークパターンが存在すると考え，研究に取り組んできている．本稿では，選択肢の遅延表示は選択を誘導しないが，先行表示は選択を誘導するという仮説のもと，選択肢を遅延表示した場合と，先行表示した場合の選択誘導の効果を評価する実験をクラウドソーシング上で実施した．実験の結果，選択肢を遅延表示したときはその選択肢が選ばれやすい傾向はないが，先行表示したときはその選択肢が選ばれやすい傾向があることがわかった．また，先行表示した選択肢が選ばれた場合は選択時間が短かった一方で，選ばれなかった場合は選択時間が長かったことが明らかになった．",
    "authors": "木下裕一朗, 関口祐豊, 植木里帆, 横山幸大, 中村聡史",
    "conference": "HCS in 沖縄",
    "date": "2023/05/16",
    "url": "https://dl.nkmr-lab.org/papers/458",
    "tagList": ["HCS", "M1", "選択", "ダークパターン"],
    "paper": "https://dl.nkmr-lab.org/papers/458/paper.pdf",
    "slide": "https://dl.nkmr-lab.org/papers/458"
  },
  {
    "title": "PP-Undo: 筆圧の制御により付与されたストロークの確信度に基づくUndo/Redo手法の提案",
    "image": "img-6",
    "description": "デジタルな手書きの機能のひとつに Undo/Redo 機能がある．しかし，既存の Undo/Redo 機能では，筆記順序に対して逐次的に行うことしかできず，筆記テストにおける解答と下書きのメモのような確信度に差があるような状況において，その確信度が低い下書きのメモだけをあとから削除するといったことはできない．そこで本研究では，筆記情報の中でも筆記の最中に調整可能なパラメータである筆圧を利用することで，確信度の高い箇所を並行して残し，その確信度ベースで Undo/Redo 機能を可能とする手法を提案する．またプロトタイプシステムを実装し，デジタル手書き支援への応用可能性を調査する．その結果，本手法を用いることでユーザの筆圧の分布が変化し，最終的にノートに残されているストローク量が大きく減少することを明らかになった．また，数名のユーザに 5 日間利用してもらったところ，1 回の提案手法 Undo で削除しているストロークの割合が増加する傾向にあることがわかった．",
    "authors": "関口祐豊, 植木里帆, 中村聡史",
    "conference": "HCI-201 in 石垣島",
    "date": "2023/01/16",
    "url": "https://dl.nkmr-lab.org/papers/421",
    "tagList": ["HCI", "B4", "手書き", "筆圧", "Undo"],
    "paper": "https://dl.nkmr-lab.org/papers/421/paper.pdf",
    "slide": "https://dl.nkmr-lab.org/papers/421",
    "code": "https://github.com/YutoSekiguchi/PP-Undo",
    "system": "https://ppundo.nkmr.io"
  },
  {
    "title": "デジタルペンの筆圧による濃淡表現の有無が筆算の正答率に及ぼす影響",
    "image": "img-5",
    "description": "教育のデジタル化により，タブレットなどを用いて手書きをする機会も増えている．ここで手書きのデジタル化がどのような影響をおよぼすのか，どのような点を考慮することが重要なのかは明らかになっていない．そこで本研究では，手書きを形成する一要素である筆圧に着目し，筆圧の有無による手書きの表現が問題を解くうえでどう影響するのかについて明らかにする．具体的には，四則演算の筆算について，筆圧の調整ができる状態と筆圧が二値化であり調整できない状態で筆算の問題の正答率にどのような影響をおよぼすのかを実験し，割り算において正答率に変化がでることを明らかにした．",
    "authors": "小林沙利, 植木里帆, 関口祐豊, 中村聡史, 掛晃幸, 石丸築",
    "conference": "HCGシンポジウム in 高松",
    "date": "2022/12/16",
    "url": "https://dl.nkmr-lab.org/papers/415",
    "tagList": ["HCG", "B4", "手書き", "筆圧"],
    "paper": "https://dl.nkmr-lab.org/papers/415/paper.pdf",
    "slide": "https://dl.nkmr-lab.org/papers/415"
  },
  {
    "title": "選択インタフェースにおけるアイテムの遅延表示が選択に及ぼす影響",
    "image": "img-4",
    "description": "ユーザが意図していない行動を誘導するダークパターンが問題となっている．ダークパターンは選択場面においても見られ，一部の選択肢を目立たせるだけでなく，ユーザの行動を誘導するユーザインタフェースの存在が報告されている．我々は，ユーザインタフェースとして一見公平であると感じるものでありながらも，選択を誘導しているものが存在していることに着目し，選択肢の遅延表示による選択誘導効果について検証を行う．具体的には，「選択肢において，1 つの選択肢のみ遅延表示したとき，遅延表示した選択肢が選ばれやすい」という仮説をたて，クラウドソーシング上で実験を実施した．実験の結果，全体では遅れて表示された選択肢が選ばれやすい傾向はないことがわかった．しかし，選択時間に応じて選択肢を遅らせる時間や位置を変えることで，選択誘導効果が変化することが明らかになった．",
    "authors": "木下裕一朗, 関口祐豊, 植木里帆, 横山幸大, 中村聡史",
    "conference": "HCI-200 in 淡路島",
    "date": "2022/11/09",
    "url": "https://dl.nkmr-lab.org/papers/409",
    "tagList": ["HCI", "B4", "選択", "ダークパターン"],
    "paper": "https://dl.nkmr-lab.org/papers/409/paper.pdf",
    "slide": "https://dl.nkmr-lab.org/papers/409"
  },
  {
    "title": "TRing: 休憩によるやる気低下を防ぐ行動支援システムの提案",
    "image": "img-3",
    "description": "面倒だと感じる作業は世の中多く存在するが，人はある場面，ある時間においてその面倒な作業をしようというやる気が高まる時がある．しかし，このやる気は作業の間で任意の休憩を挟むことにより低下してしまうという問題がある．そこで，本研究ではこのやる気の低下を抑えることで，作業の休憩後も同じやる気で作業に取り掛かることができるシステム，TRing を提案する．TRing は，作業部屋に設置した NFC リーダに利用者の身につけているリングをかざすことで，自身の休憩時間を任意で設定し，その時間をディスプレイ上で表示するというものである．利用者自らが休憩時間を設定したこと，利用者以外の誰かにその休憩時間を見られること，休憩中に身につけたリングが頻繁に視界に入ることで作業のやる気を彷彿させること，これら 3 つの影響により自発的な行動を促す．本システムを用いた評価実験を行い，その結果から得られたシステムの有用性，今後の課題について報告する．",
    "authors": "守安真也, 佐竹雪乃, 関口祐豊, 小林稔",
    "conference": "GN-116 オンライン",
    "date": "2022/03/07",
    "url": "https://ipsj.ixsq.nii.ac.jp/ej/index.php?active_action=repository_view_main_item_detail&page_id=13&block_id=8&item_id=217379&item_no=1",
    "tagList": ["GN", "B3", "休憩"],
    "paper": "https://ipsj.ixsq.nii.ac.jp/ej/?action=repository_uri&item_id=217379&file_id=1&file_no=1",
    "code": "https://github.com/YutoSekiguchi/Tring"
  },
  {
    "title": "三択の選択肢における色要因が選択行動に及ぼす影響",
    "image": "img-2",
    "description": "三択の選択肢において，大きさや値段などのように 3 段階で表現できるものが提示されると，真ん中の選択肢が選択されやすいゴルディロックス効果が知られている．我々は，このゴルディロックス効果が色にも適用され，意図せず選択を歪めている可能性に着目し，色による選択誘導効果について検証を行う．具体的には，異なる 2 色とその混色からなる三択の選択肢が提示されると，ひとは混色を選択する傾向があるという仮説をたて，クラウドソーシング上で実験を実施した．実験の結果，全体では混色が選ばれやすい傾向はなかった．しかし，女性は混色の選択肢を選択する傾向にあり，男性は混色を選択しない傾向にあることがわかった．また，三択の選択肢において混色が異なる 2 色のうちどちらかに偏って似ている類似色となっている場合，男女ともに，非類似色の選択肢を選択する傾向にあることが明らかになった．",
    "authors": "関口祐豊, 植木里帆, 横山幸大, 中村聡史",
    "conference": "HCI-195 in 淡路島",
    "date": "2021/12/01",
    "url": "https://dl.nkmr-lab.org/papers/349",
    "tagList": ["HCI", "B3", "選択", "色", "ゴルディロックス効果"],
    "paper": "https://dl.nkmr-lab.org/papers/349/paper.pdf",
    "slide": "https://dl.nkmr-lab.org/papers/349"
  },
  {
    "title": "コミクエ: 新刊読書時に前巻までの流れを想起可能とするクイズ共有手法の提案",
    "image": "img-1",
    "description": "単行本派の読者にとって，新刊を購入して読み始めたときに話の流れが分からず，前の巻や，その前の巻を読み直すということは珍しくない．前巻までのあらすじがあればある程度把握可能であるが，多くの場合十分ではない．またそもそも前巻を読んでおらず，そのあらすじがネタバレとなる可能性もある．そこで本研究では，新刊を読む際の思い出しを支援するため，クイズ形式で振り返りを可能とする手法を提案し，システムとして実装した．また運用により，その有用性について検証を行った．",
    "authors": "野中滉介, 関口祐豊, 小松原達哉, 桑原樹蘭, 中村聡史",
    "conference": "第6回コミック工学",
    "date": "2021/11/21",
    "url": "https://dl.nkmr-lab.org/papers/345",
    "tagList": ["コミック工学", "B3", "漫画", "クイズ", "https://comiqa.com"],
    "paper": "https://dl.nkmr-lab.org/papers/345/paper.pdf",
    "slide": "https://dl.nkmr-lab.org/papers/345",
    "system": "https://comiqa.com"
  }
]